Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker
The Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker class handles callbacks from TS core through Tekla.Structures.DirectManipulation.Adapter.EventRegistry.
This class provides a work around for the multiple different events coming from TS core,
which is especially required for the case of RebarShapeCatalog.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.ComponentsHandledOnPluginStart
The collection of components that for which handling must be delayed
by Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnCommandStarting(System.String) to Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnPluginStarted(System.String).
Remarks:
The delay allows TS to set additional data.
For example with RebarShapeCatalog:
- The command starts the dialog, we can not start the feature yet
- When the user presses OK in that dialog
- Current values are set and made accessible for the DialogData.GetCurrentValuesFromTs method
- The feature can be started
Do NOT add other components to this hack!! In stead, review the architecture!!

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.SyncObject
The synchronize object.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.dotNetPluginStartAndEndDifference
The difference between the amount of start and end events of creation .Net plug-ins. Used for restarting
and ending creation .Net plug-ins correctly as the platform gets the events in an incorrect order.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.onPluginStartedWasCalled
Indicates whether the Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnPluginStarted(System.String) method was called when using a creation .Net plug-in.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker class.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.CommandEnded
Occurs when a command is ended.
Remarks:
The input argument describes the ended command.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.CommandStarted
Occurs when a command is started.
Remarks:
The input argument describes the started command,
while the return value is expected to indicate whether or not the started command is consumed.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.Imports
Gets the native TS state imports.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.AsyncStartCommand(System.String)
Asynchronously starts the command.
command: Name of the command.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.RegisterHandler(System.Func{Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,System.Boolean},System.Action{Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData})
Registers the given delegates as event handlers to Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.
onCommandStarted: A delegate to the method handling the command started event.
onCommandEnded: A delegate to the method handling the command ended event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.UnregisterHandler(System.Func{Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,System.Boolean},System.Action{Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData})
Unregisters the given delegates as event handlers to Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.
onCommandStarted: A delegate to the method handling the command started event.
onCommandEnded: A delegate to the method handling the command ended event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.RaiseCommandStarted(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Raises Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.CommandStarted with the given Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData
and calls Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.SetCommandConsumed on success.
commandData: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData to use as arguments for the event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnCommandStarting(System.String)
Handles the command starting event, which occurs when TS is creating a new command context.
param: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnCommandEnded(System.String)
Handles the command ended event, which occurs when TS is destroying a command context.
param: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnPluginStarted(System.String)
Handles the plug-in started event, which is only relevant for certain plug-ins.
param: The arguments of the event.
Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.ComponentsHandledOnPluginStart

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnPluginEnded(System.String)
Handles the plug-in ended event, which is relevant for DotNet plug-ins.
param: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.CommandStartedButPluginDidNot
Indicates whether Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnCommandStarting(System.String) was called but Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.OnPluginStarted(System.String) was not
when using a creation .Net plug-in.
Returns: True if the command started but the plug-in did not start.

Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.IncreaseStartAndEndDifferenceIfNeeded(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Increases Tekla.Structures.DirectManipulation.Adapter.State.CommandEventBroker.dotNetPluginStartAndEndDifference if the command is a creation .Net plug-in
that is not delayed.
command: The command.